"""
Территория зла

В давние времена считалось, что если какая-то местность является треугольником, то в ней заключено страшное зло.

При этом люди оценивали риск встретить зло по форме этого треугольника:
    - В остроугольном треугольнике вероятность встретить зло крайне мала;
    - В тупоугольном — велика;
    - В прямоугольном — 100%.

Напишите программу, которая по длине сторон треугольной местности, определяет вероятность встретить зло.

Формат ввода:
    Три числа — длины сторон треугольной местности.

Формат вывода:
    Вероятность встретить зло согласно поверью:
        - «крайне мала»;
        - «велика»;
        - «100%».

Пример 1:
    Ввод:
        3
        5
        4
    Вывод:
        100%

Пример 2:
    Ввод:
        6
        3
        4
    Вывод:
        велика
"""

a = int(input())
b = int(input())
c = int(input())

if b == max(a, b, c):
    a, b, c = b, a, c
elif c == max(a, b, c):
    a, b, c = c, a, b

if a ** 2 > b ** 2 + c ** 2:
    print('велика')
elif a ** 2 < b ** 2 + c ** 2:
    print('крайне мала')
else:
    print('100%')
