"""
Список покупок 3.0

В этот раз семья договорилась о том, что в целях экономии бюджета, они будут совершать в день только три покупки.
Напишите программу, которая готовит варианты списков покупок.

Формат ввода:
    В первой строке задано натуральное число N — количество членов семьи.
    В следующих N строках записаны желаемые продукты (через запятую и пробел).

Формат вывода:
    Варианты списков покупок в алфавитном порядке.

Example 1:
    Input:
        2
        печенье, сушки
        чай, кофе
    Output:
        кофе печенье сушки
        кофе печенье чай
        кофе сушки печенье
        кофе сушки чай
        кофе чай печенье
        кофе чай сушки
        печенье кофе сушки
        печенье кофе чай
        печенье сушки кофе
        печенье сушки чай
        печенье чай кофе
        печенье чай сушки
        сушки кофе печенье
        сушки кофе чай
        сушки печенье кофе
        сушки печенье чай
        сушки чай кофе
        сушки чай печенье
        чай кофе печенье
        чай кофе сушки
        чай печенье кофе
        чай печенье сушки
        чай сушки кофе
        чай сушки печенье
"""

from itertools import chain, permutations

num = int(input())
items = chain.from_iterable(input().split(', ') for _ in range(num))
table = sorted(list(permutations(items, 3)))
print('\n'.join(' '.join(row) for row in table))
