"""
Ломать — не строить 2

Вашему решению будет предоставлена функция func, которая на этот раз принимает неограниченное число позиционных параметров и производит с ними некую операцию приведения типа.

Предложите вызов функции, который гарантированно породит ошибку внутри функции.

Примечание

Если ошибка произойдёт внутри функции, то она будет перехвачена и обработана. Если же она произойдёт в вашем коде, то программа будет завершена с ошибкой.

Пример 1
    Ввод:
        def func(a, b, c):
            return ''.join(map(str, (a, b, c)))

    Вывод:
        Ура! Ошибка!

Пример 2
    Ввод:
        def func(a, b):
            return set(a) ^ set(b)

    Вывод:
        Ура! Ошибка!
"""

class Error:

    def __repr__():
        _


func(Error())
