"""
Числовой прямоугольник

Ребята в детском саду учатся считать, и чтобы им было интереснее, воспитательница решила оформить список изучаемых чисел особым образом.
Дети справляются весьма быстро, поэтому ей требуется программа, способная строить числовые прямоугольники. Напишите программу, которая строит числовой прямоугольник требуемого размера.

Формат ввода:
    В первой строке записано число N — высота числового прямоугольника.
    Во второй строке указано число M — ширина числового прямоугольника.

Формат вывода:
    Нужно вывести сформированный числовой прямоугольник требуемого размера.
    Каждый столбец должен быть одинаковой ширины.

Пример 1:
    Ввод:
        2
        3
    Вывод:
        1 2 3
        4 5 6

Пример 2:
    Ввод:
        4
        6
    Вывод:
         1  2  3  4  5  6
         7  8  9 10 11 12
        13 14 15 16 17 18
        19 20 21 22 23 24
"""

height = int(input())
width = int(input())
cell = len(str(height * width))
for row in range(height):
    for col in range(width):
        num = row * width + col + 1
        end = '\n' if col == width - 1 else ' '
        print(f'{num:>{cell}}', end=end)
