Делу — время, потехе — час

Давайте передохнём от автоматизации и сделаем что-то действительно интересное.

Формат ввода
Одно натуральное число NN

Формат вывода
NN строк с фразой: "Купи слона!"

repeat = 0
while repeat <= 0:
    repeat = int(input())
for count in range(repeat):
    print("Купи слона!")
