# Наказание

# Наше развлечение не осталось незамеченным...
# И наказание нам выбрали соответствующее.

# Формат ввода
# В первой строке записано одно натуральное число N
# Во второй строке записана часть наказания.

# Формат вывода
# N строк вида: Я больше никогда не буду писать "<часть наказания>"!


repeat = int(input())
message = input()

<<<<<<< HEAD
for _ in range(repeat):
=======
for count in range(repeat):
>>>>>>> 29cca75b9a18b79cee30c2119ec4a583721ede21
    print(f'Я больше никогда не буду писать "{message}"!')
