# Делу — время, потехе — час

# Давайте передохнём от автоматизации и сделаем что-то действительно
# интересное.

# Формат ввода
# Одно натуральное число NN

# Формат вывода
# NN строк с фразой: "Купи слона!"


for _ in range(int(input())):
    print("Купи слона!")
