# Делу — время, потехе — час

# Давайте передохнём от автоматизации и сделаем что-то действительно
# интересное.

# Формат ввода
# Одно натуральное число NN

# Формат вывода
# NN строк с фразой: "Купи слона!"


while (repeat := int(input())) <= 0:

for count in range(repeat):
    print("Купи слона!")
